hselasky/isdn4bsd/src/usr.sbin/i4b/man/i4bdss1.4
.\"
.\" Copyright (c) 1997, 2002 Hellmuth Michaelis. All rights reserved.
.\" Copyright (c) 2004 Hans Petter Selasky. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: $
.\"
.\"	last edit-date: []
.\"
.Dd October 13, 2004
.Dt I4BDSS1 4
.Os
.Sh NAME
.Nm i4bdss1
.Nd ISDN4BSD pseudo device driver handling the Q.921 and Q.931 protocols
.Sh SYNOPSIS
.Cd device \&"i4bdss1\&"
.Sh DESCRIPTION
.Nm
is the ISDN D channel layer2 and layer 3 handler.
.Sh STANDARDS
ITU Recommendation Q.920, Q.921, Q.930 and Q.931.
.Sh AUTHORS
The
.Nm
driver and this manpage were re-written by
.An Hans Petter Selasky Aq hselasky@c2i.net .
.Pp
The
.Nm
driver and this manpage were initially written by
.An Hellmuth Michaelis Aq hm@FreeBSD.org .
