hselasky/isdn4bsd/i4b/i4b/isdnphone/isdnphone.8
.\"
.\" Copyright (c) 1999, 2002 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/usr.sbin/i4b/isdnphone/isdnphone.8,v 1.9 2002/08/27 14:46:22 hm Exp $
.\"
.\"
.Dd September 18, 2005
.Dt ISDNPHONE 8
.Os
.Sh NAME
.Nm isdnphone
.Nd telephone dialing and more for ISDN4BSD
.Sh SYNOPSIS
.Nm
.Op Fl d
.Op Fl h
.Op Fl k Ar string
.Op Fl n Ar number
.Op Fl u Ar unit
.Op Fl v
.Op Fl w
.Sh DESCRIPTION
The
.Nm
utility
is part of the ISDN4BSD package and is used to handle dialing and hangup
for the telephone control interfaces
.Pa /dev/i4bteld Ns Aq Ar n .
.Pp
Options are provided to dial out or hang up using command line parameters
(for use in scripts) or, if none of those options are specified, bring up
a curses-based full-screen interface.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl d
Enable debugging message display.
.It Fl h
Hang up a possibly open telephone connection on the selected interface.
.It Fl k
Send the specified string using the keypad facility information element.
.It Fl n
Dial the specified number on the selected interface.
.It Fl u
Set the unit number to specify the interface used.
.It Fl v
Enable verbose result messages for dialing (-n and -w)
.It Fl w
After dialing (using the -n option), wait for the first result message.
.El
.Sh FILES
.Bl -tag -width indent -compact
.It Pa /dev/i4bteld Ns Aq Ar n
.El
.Sh CONFIGURATION
Before
.Nm
will work, one needs a configuration entry in
.Xr /etc/isdn/isdnd.rc
\&. Here is an example on how this entry should look like:
.Bd -literal -compact
#===============================================================
# entry section: isdnphone example
#===============================================================
entry
name                    = I4BTEL        # name for reference
usrdevicename           = tel           # ipr, tel, rbch
usrdeviceunit           = 0             # unit number

isdncontroller          = 0             # controller to use
isdnchannel             = -1            # use any channel
local-phone-incoming    = XXXXXXXXXX    # this is my number
remote-phone-incoming   = *             # anyone can call in
dialin-reaction         = "alert"       # accept, reject, ignore,
                                        # answer, alert
alert                   = 15
answerprog              = answer        # program to run
b1protocol              = raw           # hdlc, raw
idletime-incoming       = 5             # 5 seconds idle timeout

.Ed
.Sh EXAMPLES
The command:
.Dl "isdnphone -n 1234"
.Pp
dials calls the number 1234 to establish a call on
.Pa /dev/i4btel0
.Sh AUTHORS
The
.Nm
utility and this manpage were written by
.An Hellmuth Michaelis Aq hm@FreeBSD.org
and later updated by
.An Hans Petter Selasky Aq hselasky@c2i.net .
